{
    "id": "career_69627468313004.94993325",
    "email": "larrybrazz70@gmail.com",
    "phone": "",
    "timestamp": "2026-01-10T16:46:48+01:00",
    "experience": 0,
    "salary_min": 0,
    "salary_max": 0,
    "resume": "OLANREWAJU ADEBAYO \r\nBusiness Analyst | Newcastle, UK \r\nolanrewajuadebayo004@gmail.com | 07823 719 099 \r\nLinkedIn \r\nProfessional Summary \r\nDynamic and detail-oriented Business Analyst with 6+ years’ experience bridging \r\nbusiness and IT to drive strategic transformation across public sector, finance, and \r\ntechnology. Proven track record in requirements elicitation, stakeholder engagement, \r\nprocess reengineering, and the delivery of value-driven change. Proficient in Agile \r\nand Waterfall environments, creating functional designs, building impact \r\nassessments, and using analytics to guide senior stakeholder decisions. Strong \r\nexperience with JIRA, Visio, Confluence, Power BI, SQL, and BPMN. Passionate \r\nabout delivering real-world benefits, improving operational readiness, and leading \r\nchange management efforts across complex ecosystems. \r\nKey Skills & Tools \r\n• Requirements Elicitation | Gap Analysis | Process Modelling (BPMN, UML) \r\n• Functional & Impact Assessments | User Journeys | Target Operating \r\nModels \r\n• Business Case Development | Benefits Realisation | Stakeholder \r\nWorkshops \r\n• Agile & Waterfall Delivery | User Stories | Sprint Planning | UAT \r\nCoordination \r\n• Change Readiness | Communication & Training Plans | Business Transition \r\n• Tools: JIRA, Confluence, MS Visio, Excel, Power BI, SQL, MS Project \r\n• Certifications: Agile Scrum Master | Lean Six Sigma Green Belt | Cisco Data \r\nAnalytics | BCS BA Foundation (In Progress) \r\nProfessional Experience \r\nSenior Business Analyst – Data & Digital Transformation \r\nChronus Solutions | April 2024 – Present \r\n• Captured and validated requirements from product owners, transforming them \r\ninto clear backlog items and functional documentation for development teams. \r\n• Produced end-to-end process flows, BPMN diagrams, business rules \r\ncatalogues and functional specifications to define current and future state \r\noperations. \r\n• Developed predictive dashboards in Power BI and SQL, reducing reporting \r\ndelays by 35% and increasing stakeholder engagement in weekly stand-ups. \r\n• Facilitated workshops across business units to define acceptance criteria and \r\nidentify gaps across interdependent platforms. \r\n• Led business impact assessments, quantifying changes across customer ops, \r\nbilling, and digital channels, informing executive prioritisation. \r\n• Built comms strategies and training guides for internal teams, increasing \r\nsystem adoption by 40%. \r\n• Coached junior analysts in Agile ceremonies, backlog refinement, and \r\nstakeholder alignment. \r\n• Reduced delivery risk by implementing traceability matrices and requirements \r\ntrace log, ensuring development met business needs. \r\n• Supported UAT and managed defect triage between developers and users to \r\nexpedite fixes and avoid project delays. \r\n• Ensured operational readiness through run-books, checklists, and transition\r\nto-support documentation. \r\nBusiness Analyst – Service Improvement & Analytics \r\nLWP | Apr 2023 – Sept 2024 \r\n• Gathered business requirements using interviews and workshops, translating \r\nthem into user stories and acceptance criteria for development sprints. \r\n• Utilised Visio and BPMN to model AS-IS and TO-BE processes, supporting \r\nsystem migrations and service redesigns. \r\n• Delivered performance dashboards linked to real-time SLAs and throughput \r\nmetrics, improving decision lead times by 60%. \r\n• Coordinated with architects and testers to ensure end-to-end coverage from \r\nrequirement through to test script execution. \r\n• Led change impact and transition planning, including risk analysis, benefits \r\nmapping and stakeholder readiness assessments. \r\n• Created and managed Confluence spaces for knowledge transfer, change \r\nlogs, and product documentation. \r\n• Partnered with service managers to map comms and change plans, reducing \r\npost-launch support tickets by 30%. \r\n• Supported release readiness through go/no-go criteria, user training, and \r\nparallel run planning. \r\n• Facilitated retrospectives and improvement sessions post-implementation, \r\nembedding lessons learned into BAU. \r\n• Built detailed business cases justifying tech investments with measurable ROI \r\nand benefit profiles. \r\nBusiness Analyst – Regulatory & Compliance Operations \r\nUnity Bank Plc | Jan 2018 – Dec 2022 \r\n• Defined compliance data flows and reporting structures across departments, \r\naligning with regulatory needs and GDPR standards. \r\n• Conducted stakeholder interviews to capture functional and non-functional \r\nrequirements for internal audits and system upgrades. \r\n• Created traceable requirement sets, linked to policies and controls, resulting \r\nin 98% audit success rate. \r\n• Led training workshops for 50+ users across risk and compliance teams post\r\nplatform implementation. \r\n• Developed SOPs, user guides, and operating procedures aligned to \r\nISO27001. \r\n• Supported business readiness for new compliance platforms, including",
    "certifications": "",
    "temperament": "Analytical",
    "ideal_company": "remote",
    "energy_drainers": [
        "public_speaking"
    ],
    "energy_gainers": [
        "problem_solving",
        "autonomy"
    ],
    "newsletter": 0,
    "cv_file_path": "C:\\xampp\\htdocs\\chronuswebsite-main/data/uploads/cv_6962746830ee46.24594253_Olanrewaju_CV__1_.pdf",
    "cv_original_name": "Olanrewaju CV (1).pdf",
    "status": "submitted"
}